app/controllers/attendants_controller.rb

  def create
    @demo = Demo.find(params[:demo_id])
    # @attendant = Demo.attendants.new
    @attendant = @demo.attendants.create(attendant_params)
---
SELECT  "demos".* FROM "demos" WHERE "demos"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "attendants" ("first_name", "last_name", "email", "npi", "demo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["first_name", "sdf"], ["last_name", "asdf"], ["email", "asdfasdf"], ["npi", 0], ["demo_id", 3], ["created_at", "2015-04-04 17:45:28.049296"], ["updated_at", "2015-04-04 17:45:28.049296"]]