app/controllers/demos_controller.rb

SELECT "demos".* FROM "demos"  ORDER BY created_at DESC
---
  def index
    @demos = Demo.all.order('created_at DESC')

SELECT  "demos".* FROM "demos" WHERE "demos"."id" = ? LIMIT 1  [["id", 4]]
SELECT "attendants".* FROM "attendants" WHERE "attendants"."demo_id" = ?  ORDER BY created_at DESC  [["demo_id", 5]]
---
  def show
    @demo = Demo.find(params[:id])
    @attendants = @demo.attendants.order('created_at DESC')

INSERT INTO "demos" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "asd"], ["created_at", "2015-04-04 07:04:00.647531"], ["updated_at", "2015-04-04 07:04:00.647531"]]
---
  def create
    @demo = Demo.new(demo_params)
    if @demo.save

SELECT  "demos".* FROM "demos" WHERE "demos"."id" = ? LIMIT 1  [["id", 5]]
---
  def edit
    @demo = Demo.find(params[:id])

SELECT  "demos".* FROM "demos" WHERE "demos"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "demos" SET "title" = ?, "updated_at" = ? WHERE "demos"."id" = ?  [["title", "345345"], ["updated_at", "2015-04-04 07:36:20.013257"], ["id", 7]]
---
  def update
    @demo = Demo.find(params[:id])
    if @demo.update(demo_params)

SELECT  "demos".* FROM "demos" WHERE "demos"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "demos" WHERE "demos"."id" = ?  [["id", 1]]
---
  def destroy
    @demo = Demo.find(params[:id])
    @demo.destroy